fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакОтпуска</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)

	ДатаНачалаОтпуска = ТекущийЭлемент.ТекущиеДанные.ДатаНачала;
	
	Если Год(ДатаНачалаОтпуска) <> Объект.Год Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Неправильный год отпуска.";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ДатаОкончанияОтпуска = ТекущийЭлемент.ТекущиеДанные.ДатаОкончания;
	
	Если Не ЗначениеЗаполнено(ДатаОкончанияОтпуска) Тогда
		
		Объект.ПометкаУдаления = Ложь;
		Возврат;
		
	Иначе
		
		Если ДатаНачалаОтпуска >= ДатаОкончанияОтпуска Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата начала отпуска должна быть меньше даты окончания отпуска.";
			Сообщение.Сообщить();
		
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Сотрудник = ТекущийЭлемент.ТекущиеДанные.Сотрудник;
	
	КоличествоДнейОтпуска = ПроверитьКоличествоДнейОтпуска(Сотрудник);
	
	ПрОтпуска = (КоличествоДнейОтпуска > 28);
		
	УстановкаПризнакаОтпусков(Сотрудник, ПрОтпуска);

	ЭтаФорма.Прочитать();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)

	ДатаОкончанияОтпуска = ТекущийЭлемент.ТекущиеДанные.ДатаОкончания;
	
	Если Год(ДатаОкончанияОтпуска) <> Объект.Год Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Неправильный год отпуска.";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ДатаНачалаОтпуска = ТекущийЭлемент.ТекущиеДанные.ДатаНачала;
	
	Если Не ЗначениеЗаполнено(ДатаНачалаОтпуска) Тогда
		
		Объект.ПометкаУдаления = Ложь;
		Возврат;
		
	Иначе
		
		Если ДатаОкончанияОтпуска <= ДатаНачалаОтпуска Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата начала отпуска должна быть меньше даты окончания отпуска.";
			Сообщение.Сообщить();
		
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Сотрудник = ТекущийЭлемент.ТекущиеДанные.Сотрудник;
	
	КоличествоДнейОтпуска = ПроверитьКоличествоДнейОтпуска(Сотрудник);

	ПрОтпуска = (КоличествоДнейОтпуска > 28);
		
	УстановкаПризнакаОтпусков(Сотрудник, ПрОтпуска);
	
	ЭтаФорма.Прочитать();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьКоличествоДнейОтпуска(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
		|	И ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КоличествоДнейОтпуска = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		 КоличествоДнейОтпуска = КоличествоДнейОтпуска + 
		 		(НачалоДня(ВыборкаДетальныеЗаписи.ДатаОкончания) - НачалоДня(ВыборкаДетальныеЗаписи.ДатаНачала)) / (60 * 60 * 24) + 1;
		
	КонецЦикла;
	
	Возврат КоличествоДнейОтпуска;
	
КонецФункции

&НаСервере
Процедура УстановкаПризнакаОтпусков(Сотрудник, ПрОтпуска)

	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		Если Строка.Сотрудник <> Сотрудник Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Строка.ПризнакОтпуска = ПрОтпуска;
		
	КонецЦикла;
	
	ЭтотОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура АнализДокумента(Команда)
	
	СсылкаХранилища = ПолучитьСсылкаХранилища();
	
	НовыйПараметры = Новый Структура;
	НовыйПараметры.Вставить("СсылкаХранилища", СсылкаХранилища);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализДокумента", НовыйПараметры, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкаХранилища()

	ТаблицаОтпускаСотрудников = Объект.ОтпускаСотрудников.Выгрузить();
	
	СсылкаХранилища = ПоместитьВоВременноеХранилище(ТаблицаОтпускаСотрудников);
	
	Возврат СсылкаХранилища;
	
КонецФункции

#КонецОбласти
